InformationRegisters/ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДопустимыеЗначенияПотребительскихСвойствЗЕРНО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиапазонС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиапазонПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенияПотребительскогоСвойстваЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимыеЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПотребительскоеСвойство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНСИЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНСИЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДопустимыеЗначенияПотребительскихСвойствЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Допустимые потребительские свойства.
// 
// Параметры:
//  ОКПД2 - Строка - ОКПД2
//  Назначение - СправочникСсылка.КлассификаторНСИЗЕРНО - Назначение
//  Страна - Неопределено, СправочникСсылка.СтраныМира - Страна
// 
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - Допустимые потребительские свойства
Функция ДопустимыеПотребительскиеСвойства(ОКПД2, Назначение, Страна = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОКПД2) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Страна = Неопределено Тогда
		Страна = Справочники.СтраныМира.Россия;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтраныМира.КодАльфа2 КАК КодАльфа2
	|ПОМЕСТИТЬ КодСтраныНазначения
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира
	|ГДЕ
	|	СтраныМира.Ссылка = &Страна
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ПотребительскоеСвойство КАК ПотребительскоеСвойство,
	|	ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ОКПД2                   КАК ОКПД2,
	|	ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ДиапазонС               КАК ДиапазонС,
	|	ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ДиапазонПо              КАК ДиапазонПо,
	|	ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ТипЗначения             КАК ТипЗначения,
	|	ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ДопустимыеЗначения      КАК ДопустимыеЗначения,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(28))                                         КАК ПредставлениеДиапазона,
	|
	|	ЕСТЬNULL(ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ПотребительскоеСвойство.Идентификатор, """") КАК ПотребительскоеСвойствоИдентификатор
	|ИЗ
	|	РегистрСведений.ДопустимыеЗначенияПотребительскихСвойствЗЕРНО КАК ДопустимыеЗначенияПотребительскихСвойствЗЕРНО
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ КодСтраныНазначения КАК КодСтраныНазначения
	|		ПО ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.КодСтраны = КодСтраныНазначения.КодАльфа2
	|ГДЕ
	|	ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ОКПД2 В (&ОКПД2)
	|	И ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.Назначение = &Назначение
	|	И (ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ДействуетПо >= &Дата
	|		Или ДопустимыеЗначенияПотребительскихСвойствЗЕРНО.ДействуетПо = ДатаВремя(1,1,1))
	|";
	Запрос.УстановитьПараметр("ОКПД2", ОКПД2);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Страна", Страна);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПотребительскиеСвойства = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультата Из ПотребительскиеСвойства Цикл
		СтрокаРезультата.ПредставлениеДиапазона = ИнтеграцияЗЕРНОКлиентСервер.ПредставлениеДопустимыхЗначенийПоДиапазону(
			СтрокаРезультата);
	КонецЦикла;
	
	ПотребительскиеСвойства.Индексы.Добавить("ОКПД2");
	ПотребительскиеСвойства.Индексы.Добавить("ПотребительскоеСвойство");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПотребительскиеСвойства;
	
КонецФункции

#КонецОбласти

#КонецЕсли
